cask_args appdir: '/Applications'

tap "atlassian/homebrew-acli"
tap "aws/tap"
tap "derailed/k9s"
tap "dopplerhq/cli"
tap "oven-sh/bun"
tap "pulumi/tap"
tap "stripe/stripe-cli"

brew "acli"
brew "antidote"
brew 'postgresql@17', link: true
brew "aws-iam-authenticator"
brew "awscli"
brew "biome"
brew "btop"
brew "cocoapods"
brew "dotnet"
brew "eksctl"
brew "erlang"
brew "elixir"
brew "fastlane"
brew "ffmpeg"
brew "fzf"
brew "fzy"
brew "helm"
brew "temporal"

# Modern CLI tools
brew "atuin"        # magical shell history with SQLite backend + sync
brew "bat"          # cat with syntax highlighting
brew "direnv"       # per-directory env vars
brew "eza"          # modern ls replacement
brew "fd"           # fast, ergonomic find
brew "git-delta"    # better git diff viewer
brew "lazygit"      # TUI for git
brew "mas"          # Mac App Store CLI
brew "mole"         # `mo clean` — cache/junk cleaner (whitelist lives in dotfiles/mole/)
brew "ripgrep"      # fast grep (rg)
brew "zoxide"       # smart cd
brew "tree"
brew "htop"
brew "gh"

brew "git"
brew "git-filter-repo"
brew "git-lfs"
brew "gnu-sed"
brew "gnupg"
brew "go"
brew "graphviz"
brew "jq"
brew "k6"
brew "mosh"
brew "k9s"
brew "kubernetes-cli"
brew "kubectx"
brew "mise"
brew "nats-server", restart_service: :changed
brew "neovim"
brew "nmap"
brew "node"
brew "pgvector"
brew "pipx"
brew "r"
brew "redis", restart_service: :changed
brew "rust"
brew "solargraph"
brew "ssh-copy-id"
brew "starship"
brew "temporal"
brew "tmux"
brew "tpm"
brew "unzip"
brew "uv"
brew "websocat"
brew "wget"
brew "yarn"
brew "yt-dlp"

# Terminal recording / content creation
brew "asciinema"    # record terminal sessions as .cast (embeddable, text-based)
brew "vhs"          # scriptable terminal recordings -> GIF/MP4/WEBM

# Taps
brew "derailed/k9s/k9s"
brew "dopplerhq/cli/doppler", link: true
brew "oven-sh/bun/bun"
brew "stripe/stripe-cli/stripe"
brew "peonping/tap/peon-ping"
# docker/tap/sbx is installed separately in bootstrap.sh via
# `brew install docker/tap/sbx` (see https://docs.docker.com/ai/sandboxes/).
# brew bundle's stricter formula/cask split refuses to resolve it here.

# Casks
cask "android-platform-tools"
cask "android-studio"
cask "brewservicesmenubar"
cask "bruno"
cask "chatgpt"
cask "claude"
cask "codex"
cask "cloudflare-warp"
cask "dbeaver-community"
cask "figma"
cask "font-hack-nerd-font"
cask "gcloud-cli"
cask "iterm2"
cask "ngrok"
cask "orbstack"
cask "rectangle"
cask "rstudio"
cask "slack"
cask "tailscale-app"
cask "vlc"
cask "visual-studio-code"
cask "discord"
cask "ollama-app"
cask "viscosity"
cask "zoom"
cask "lm-studio"
cask "cursor"
cask "qgis"
cask "raspberry-pi-imager"
