cask_args appdir: '/Applications'

tap "aws/tap"
tap "derailed/k9s"
tap "dopplerhq/cli"
tap "oven-sh/bun"
tap "pulumi/tap"
tap "stripe/stripe-cli"

brew "antidote"
brew 'starship'
brew 'postgresql@17', link: true
brew "aws-iam-authenticator"
brew "awscli"
brew "biome"
brew "btop"
brew "cocoapods"
brew "diff-so-fancy"
brew "dotnet"
brew "eksctl"
brew "erlang"
brew "elixir"
brew "fastlane"
brew "ffmpeg"
brew "fzy"
brew "helm"
brew "htop"
brew "gh"
brew "git"
brew "git-filter-repo"
brew "git-lfs"
brew "gnu-sed"
brew "gnupg"
brew "go"
brew "jq"
brew "k6"
brew "kubernetes-cli"
brew "kubectx"
brew "mise"
brew "nats-server", restart_service: :changed
brew "neovim"
brew "node"
brew "pgvector"
brew "pipx"
brew "r"
brew "redis", restart_service: :changed
brew "rust"
brew "ssh-copy-id"
brew "starship"
brew "tmux"
brew "unzip"
brew "wget"
brew "yarn"
brew "yt-dlp"

# Taps
brew "derailed/k9s/k9s"
brew "dopplerhq/cli/doppler", link: false
brew "oven-sh/bun/bun"
brew "stripe/stripe-cli/stripe"

# Casks
cask "android-platform-tools"
cask "android-studio"
cask "brewservicesmenubar"
cask "bruno"
cask "chromedriver"
cask "claude"
cask "font-hack-nerd-font"
cask "ngrok"
cask "orbstack"
cask "rar"
cask "rectangle"
cask "rstudio"
cask "slack"
cask "visual-studio-code"
cask "discord"
cask "ollama"
cask "viscosity"
cask "zoom"
cask "lm-studio"
cask "cursor"
cask 'raycast'
