{
  "$schema": "https://aka.ms/winget-packages.schema.2.0.json",
  "CreationDate": "2026-04-22T00:00:00.000-00:00",
  "Sources": [
    {
      "Packages": [
        { "PackageIdentifier": "Microsoft.PowerShell" },
        { "PackageIdentifier": "Microsoft.WindowsTerminal" },
        { "PackageIdentifier": "Microsoft.VisualStudioCode" },
        { "PackageIdentifier": "Anysphere.Cursor" },
        { "PackageIdentifier": "Git.Git" },
        { "PackageIdentifier": "GitHub.cli" },
        { "PackageIdentifier": "tailscale.tailscale" },
        { "PackageIdentifier": "Anthropic.Claude" },
        { "PackageIdentifier": "OpenAI.ChatGPT" },
        { "PackageIdentifier": "Docker.DockerDesktop" },
        { "PackageIdentifier": "Mozilla.Firefox" },
        { "PackageIdentifier": "Google.Chrome" },
        { "PackageIdentifier": "SlackTechnologies.Slack" },
        { "PackageIdentifier": "Discord.Discord" },
        { "PackageIdentifier": "Zoom.Zoom" },
        { "PackageIdentifier": "VideoLAN.VLC" },
        { "PackageIdentifier": "Spotify.Spotify" },
        { "PackageIdentifier": "DBeaver.DBeaver.Community" },
        { "PackageIdentifier": "Figma.Figma" },
        { "PackageIdentifier": "usebruno.Bruno" },
        { "PackageIdentifier": "Ngrok.Ngrok" },
        { "PackageIdentifier": "Ollama.Ollama" },
        { "PackageIdentifier": "QGIS.QGIS" }
      ],
      "SourceDetails": {
        "Argument": "https://cdn.winget.microsoft.com/cache",
        "Identifier": "Microsoft.Winget.Source_8wekyb3d8bbwe",
        "Name": "winget",
        "Type": "Microsoft.PreIndexed.Package"
      }
    }
  ],
  "WinGetVersion": "1.7.0"
}
